IDEA Open Model
HangingAroundPatch.Rotation Property
Compatible with IDEA StatiCa v 10.1
 Angle of reinforcement rotation around patch point
 Namespace: IdeaRS.OpenModel.Detail
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 10.1.1.1 (10.1.1.1)
Syntax
public double Rotation { get; set; }
Public Property Rotation As Double
	Get
	Set
public:
property double Rotation {
	double get ();
	void set (double value);
}
Property Value
Type: Double
See Also
Reference
HangingAroundPatch Class
IdeaRS.OpenModel.Detail Namespace